[⬅️ MAIN][main]<br>[⬅️ Yandex][Yandex]  

[main]: ./../../../README.md
[Yandex]: ./../../README.md
[Yandex_AT_01_02_orig]: https://contest.yandex.ru/contest/27472
[Yandex_AT_01_02_J]: https://contest.yandex.ru/contest/27472/problems/J/

# [Яндекс. Тренировки по алгоритмам июнь 2021, занятие 2][Yandex_AT_01_02_orig]
## [J. Треугольник Максима][Yandex_AT_01_02_J]

|||
|--------------------|----------------------------------|
|Ограничение времени |1 секунда                         |
|Ограничение памяти  |64 Mb                             |
|Ввод                |стандартный ввод или input.txt    |
|Вывод               |стандартный вывод или output.txt  |
|||

С детства Максим был неплохим музыкантом и мастером на все руки. Недавно он самостоятельно сделал несложный перкуссионный музыкальный инструмент — треугольник. Ему нужно узнать, какова частота звука, издаваемого его инструментом.

У Максима есть профессиональный музыкальный тюнер, с помощью которого можно проигрывать ноту с заданной частотой. Максим действует следующим образом: он включает на тюнере ноты с разными частотами и для каждой ноты на слух определяет, ближе или дальше она к издаваемому треугольником звуку, чем предыдущая нота. Поскольку слух у Максима абсолютный, он определяет это всегда абсолютно верно.

Вам Максим показал запись, в которой приведена последовательность частот, выставляемых им на тюнере, и про каждую ноту, начиная со второй, записано — ближе или дальше она к звуку треугольника, чем предыдущая нота. Заранее известно, что частота звучания треугольника Максима составляет не менее ${30}$ герц и не более ${4000}$ герц.

Требуется написать программу, которая определяет, в каком интервале может находиться частота звучания треугольника.


---
### Формат ввода
Первая строка входного файла содержит целое число n — количество нот, которые воспроизводил Максим с помощью тюнера ${(2 ≤ n ≤ 1000)}$. Последующие n строк содержат записи Максима, причём каждая строка содержит две компоненты: вещественное число ${f_i}$ — частоту, выставленную на тюнере, в герцах ${(30 ≤ f_i ≤ 4000)}$, и слово ***«closer»*** или слово ***«further»*** для каждой частоты, кроме первой.

Слово ***«closer»*** означает, что частота данной ноты ближе к частоте звучания треугольника, чем частота предыдущей ноты, что формально описывается соотношением: ${|f_i − f_{triangle}| < |f_i − 1 − f_{triangle}|}$.

Слово ***«further»*** означает, что частота данной ноты дальше, чем предыдущая.

Если оказалось, что очередная нота так же близка к звуку треугольника, как и предыдущая нота, то Максим мог записать любое из двух указанных выше слов.

Гарантируется, что результаты, полученные Максимом, непротиворечивы.


### Формат вывода
В выходной файл необходимо вывести через пробел два вещественных числа — наименьшее и наибольшее возможное значение частоты звучания треугольника, изготовленного Максимом. Числа должны быть выведены с точностью не хуже ${10^{−6}}$.

---
### Примеры
|           |Ввод                                                   |Вывод          |
|-----------|-------------------------------------------------------|---------------|
|Пример 1   |3<br>440<br>220 closer<br>300 further                  |30.0 260.0     |
||||
|Пример 2   |4<br>554<br>880 further<br>440 closer<br>622 closer    |531.0  660.0   |
|||


---
### Решение (Swift)
[AlgorithmicTraining_01_02]: ./../../YandexTasks.Swift/YandexTasks/Sources/YandexTasks/AlgorithmicTraining_01_02.swift
[AlgorithmicTraining_01_02_Tests]: ./../../YandexTasks.Swift/YandexTasks/Tests/YandexTasksTests/AlgorithmicTraining_01_02_Tests.swift

1. [AlgorithmicTraining_01_02.swift][AlgorithmicTraining_01_02]
2. [AlgorithmicTraining_01_02_Tests.swift][AlgorithmicTraining_01_02_Tests]

```swift
import Foundation


let n = Int(readLine()!)!
var records: [String] = []

for _ in 0..<n { records.append(readLine()!) }

let solution = AlgorithmicTraining_01_02()
let result = solution.problem_J(n, records)

print("\(String(format: "%.6f", result[0])) \(String(format: "%.6f", result[1]))")


class AlgorithmicTraining_01_02 {
    func problem_J(_ n: Int, _ records: [String]) -> [Double] {
        var result = (min: 30.0, max: 4000.0)
        var cur = 0.0, prev = 0.0, word = "", tmp = 0.0
        var record: [String] = []
        cur = Double(records[0])!
        
        for i in 1..<records.count {
            record = Array(records[i].split(separator: " ").map({ String($0) }))
            prev = cur
            cur = Double(record[0])!
            word = record[1]
            tmp = (prev + cur) / 2

            if word == "further" {
                if cur > prev {
                    result.max = min(result.max, tmp)
                }
                else {
                    result.min = max(result.min, tmp)
                }
            } else if word == "closer" {
                if cur > prev {
                    result.min = max(result.min, tmp)
                }
                else {
                    result.max = min(result.max, tmp)
                }
            }

        }
        
        return [result.min, result.max]
    }
}
```


---